// Алгоритмы типы:
// 1. Константные
    // Число ПИ
// 2. Логарифмические
    // log2(n) - 7 ходов
// 3. Линейные
    // b= x+n;
// 4. Линейно-лагорифмические
    // Быстрая сортировка
// 5. Квадратичные
    // int count = 0;
    // for (int i = 0; i < 5; i++)
    // {
    //     for (int j = 0; j < 5; j++)
    //         count++;
    // }
    // Console.WriteLine(count);
    
    // НОД(Наибольшее общее деление)-Алгоритм Евклида
    // int n = 14;
    // int m = 140;
    // int count = m * n;
    // while (n != m)
    // {
    //     if (n > m)
    //         n = n - m;
    //     else
    //         m = m - n;
    // }
    // Console.WriteLine(count/n);

// 6. Кубические
